src/Catalogs/ВариантыОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОкругления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаОкругления</Name>
					<Comment>Правила округления</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПороговаяСумма</Name>
							<Comment>Пороговая сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнаковПослеЗапятой</Name>
							<Comment>Знаков после запятой</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодОкругления</Name>
							<Comment>Правила округления</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОкругления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратно</Name>
							<Comment>Округлять кратно значению округления</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/МетодыОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>МетодыОкругления</Name>
			<Comment>Правила округления</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБольшуюСтрону</Name>
					<Comment>Число округляется до ближайшго числа большего разряда</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоАрифимитическимПравилам</Name>
					<Comment>Число округляется по правилам арифметики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоБлижайшей9</Name>
					<Comment>Округление идет до ближайшей девятки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоБлижайших99</Name>
					<Comment>Округление идет до ближайших 99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМеньшуюСторону</Name>
					<Comment>Число округляется до ближайшго числа меньшего разряда</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Признак ведения учета в в валюте учета </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Цена включает НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОпределенияЦеныКонкурента</Name>
					<Comment>0 - Приоритет,1 - Минимум, 2 - Среднее</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчетаЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОкругления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВариантыОкругления/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Должности"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Создает кэш-таблицу, в которую помещаются категории цен и правила 
// округления цен по ним. Используется в дальнейшей работе обработки
Функция ПолучитьПравилаОкругления(ВариантОкругления)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ПравилаОкругления.ПороговаяСумма КАК ПороговаяСумма,
	|	ПравилаОкругления.ЗнаковПослеЗапятой КАК ЗнаковПослеЗапятой,
	|	ПравилаОкругления.МетодОкругления КАК МетодОкругления,
	|	ПравилаОкругления.ЗначениеОкругления КАК ЗначениеОкругления,
	|	ПравилаОкругления.Кратно
	|ИЗ
	|	Справочник.ВариантыОкругления.ПравилаОкругления КАК ПравилаОкругления
	|ГДЕ
	|	ПравилаОкругления.Ссылка = &ВариантОкругления
	|УПОРЯДОЧИТЬ ПО
	|	ПороговаяСумма УБЫВ
	|");
	
	Запрос.УстановитьПараметр("ВариантОкругления", ВариантОкругления);
	
	ПравилаОкругления = Запрос.Выполнить().Выгрузить();
	
	Возврат ПравилаОкругления;
	
КонецФункции

// Функция округления цены по правилам ее категории.
// Для работы используется кэш-таблица правил округления
Функция ОкруглитьЦенуПоТипуЦен(ТипЦен, ГруппаНоменклатуры = Неопределено, ВхЦена) Экспорт
	
	Цена = Число(ВхЦена);
	
	Если Цена = 0 Тогда
		Возврат Цена;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		Возврат ОкруглитьЦену(ТипЦен.ВариантОкругления, Цена);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекРодитель  = ГруппаНоменклатуры.Родитель;
	Уровень      = 1;
	ТекстЗапроса = "";
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		ТекстУровень = Формат(Уровень, "ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("ГруппаНоменклатуры"+ТекстУровень, ТекРодитель);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦен.ВариантОкругления
		|ИЗ
		|	Справочник.ТипыЦен.ВариантыОкругления КАК ТипыЦен
		|ГДЕ
		|	ТипыЦен.Ссылка = &ТипЦен И 
		|	ТипыЦен.ГруппаНоменклатуры = &ГруппаНоменклатуры"+ТекстУровень+" И 
		|	(НЕ ТипыЦен.ВариантОкругления = ЗНАЧЕНИЕ(Справочник.ВариантыОкругления.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ";
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТипыЦен.ВариантОкругления
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТипыЦен.Ссылка = &ТипЦен И 
	|	(НЕ ТипыЦен.ВариантОкругления = ЗНАЧЕНИЕ(Справочник.ВариантыОкругления.ПустаяСсылка))
	|";
	
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = ОкруглитьЦену(Выборка.ВариантОкругления, Цена);
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

// Функция округления цены по правилам ее категории.
// Для работы используется кэш-таблица правил округления
Функция ОкруглитьЦену(ВариантОкругления, ВхЦена) Экспорт
	
	Цена = Число(ВхЦена);
	
	Если Цена = 0 Тогда
		Возврат Цена;
	КонецЕсли;
	
	Если ТипЗнч(ВариантОкругления) = Тип("СправочникСсылка.ВариантыОкругления") Тогда
		ПравилаОкругления = ПолучитьПравилаОкругления(ВариантОкругления);
	Иначе
		ПравилаОкругления = ВариантОкругления.ПравилаОкругления.Выгрузить();
		ПравилаОкругления.Сортировать("ПороговаяСумма УБЫВ");
	КонецЕсли;
	
	// Если таки чегой-то есть - по нему и строим округление
	ПравилоОкругления = Неопределено;
	Для Каждого СтрокаПравил ИЗ ПравилаОкругления Цикл
		Если Цена >= СтрокаПравил.ПороговаяСумма Тогда 
			ПравилоОкругления = СтрокаПравил;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОкруглятьВБольшуюСторону = ВариантОкругления.ОкруглятьВБольшуюСторону;
	Точность                 = ВариантОкругления.Точность;
	
	Если ПравилоОкругления = Неопределено Тогда
		Если ОкруглятьВБольшуюСторону Тогда
			Возврат (Цел(Цена * Pow(10, Точность) + 1)) / Pow(10, Точность);
		Иначе
			Возврат Окр(Цена, Точность,2);
		КонецЕсли;
	КонецЕсли;

	// Анализируем что нашли и по результатам производим округление
	ЗнаковПослеЗапятой = ПравилоОкругления.ЗнаковПослеЗапятой;
	Если ЗнаковПослеЗапятой>2 тогда
		Шаблон = НСтр("ru = 'Цена не может быть округлена до %1 знаков после запятой. Максимальное значение 2 знака.'");
		ТекстСообщения = СтрШаблон(Шаблон, ЗнаковПослеЗапятой);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Цена;
	КонецЕсли;
	
	ЗначениеОкругления = ПравилоОкругления.ЗначениеОкругления;
	МетодОкругления    = ПравилоОкругления.МетодОкругления;
	
	Попытка
		//bomaks:Начало
		Если ПравилоОкругления.Кратно Тогда
			Если ЗначениеОкругления=0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Цена не может быть округлена кратно 0'"));
				Возврат Цена;
			КонецЕсли;
				
			НоваяЦена = Цена*Pow(10,ЗнаковПослеЗапятой)/ЗначениеОкругления;
			Если МетодОкругления=Перечисления.МетодыОкругления.ВМеньшуюСторону Тогда
				НоваяЦена = Цел(НоваяЦена);
			ИначеЕсли МетодОкругления=Перечисления.МетодыОкругления.ВБольшуюСтрону Тогда
				НоваяЦена = ?(НоваяЦена - Цел(НоваяЦена)>0,Цел(НоваяЦена)+1,Цел(НоваяЦена))
			Иначе
				НоваяЦена = Окр(НоваяЦена);
			КонецЕсли;
			Возврат НоваяЦена/Pow(10,ЗнаковПослеЗапятой)*ЗначениеОкругления;
		КонецЕсли;
		//bomaks:Конец
		Если ЗначениеОкругления=0 Тогда
			//В этом случае алгоритм несколько проще...
			Если МетодОкругления=Перечисления.МетодыОкругления.ВМеньшуюСторону Тогда
				НоваяЦена=(Цел(Цена * Pow(10,ЗнаковПослеЗапятой))) / Pow(10,ЗнаковПослеЗапятой);
			ИначеЕсли МетодОкругления=Перечисления.МетодыОкругления.ВБольшуюСтрону Тогда
				Степень=Pow(10,ЗнаковПослеЗапятой);
				ЦенаВСтепени=Цена*Степень;
				ЦелаяЦенаВСтепени=Цел(ЦенаВСтепени);
				Если ЦенаВСтепени=ЦелаяЦенаВСтепени Тогда
					НоваяЦена=(Цел(ЦенаВСтепени))/Степень;
					//НоваяЦена=(Цел(Цена * Pow(10,ЗнаковПослеЗапятой) + 1)) / Pow(10,ЗнаковПослеЗапятой);
				Иначе
					НоваяЦена=(Цел(ЦенаВСтепени + 1))/Степень;
				КонецЕсли;
			Иначе
				НоваяЦена=Окр(Цена,ЗнаковПослеЗапятой,1);
			КонецЕсли;
			Возврат НоваяЦена;
		КонецЕсли;
		ЦЦ=Окр(Цена,2,1)*100;
		СтрокаЦЦ=Формат(ЦЦ,"ЧН=0; ЧГ=0");
		ДлинаЗначения=СтрДлина(Формат(ЗначениеОкругления,"ЧН=0; ЧГ=0"));
		СколькоПоследних=2-ЗнаковПослеЗапятой+ДлинаЗначения;
		Если СтрДлина(СтрокаЦЦ)>СколькоПоследних Тогда
			ПоследниеСимволы=Прав(СтрокаЦЦ,СколькоПоследних);
			БольшиеПоследниеСимволы="1"+ПоследниеСимволы;
		Иначе
			ПоследниеСимволы=СтрокаЦЦ;
			БольшиеПоследниеСимволы="1"+ПоследниеСимволы;
		КонецЕсли;
		ПоследниеЧисла=Число(ПоследниеСимволы);
		БольшиеПоследниеЧисла=Число(БольшиеПоследниеСимволы);
		
		НовыеПоследниеЧисла=ЗначениеОкругления/Pow(10,ЗнаковПослеЗапятой-2);
		НовыеПоследниеСтроки=Формат(НовыеПоследниеЧисла,"ЧН=0; ЧГ=0");
		ДлинаНовыхСтрок=СтрДлина(НовыеПоследниеСтроки);
		БольшиеНовыеПоследниеЧисла=Число("1"+НовыеПоследниеСтроки);
		
		Если ДлинаНовыхСтрок<=СтрДлина(СтрокаЦЦ) Тогда
			Если НовыеПоследниеЧисла=ПоследниеЧисла Тогда
				//Все хорошо, никто никуда не идет, все играют...
				Возврат Цена;
			ИначеЕсли НовыеПоследниеЧисла>ПоследниеЧисла Тогда
				БольшойКоэффициентКорректировки=НовыеПоследниеЧисла-ПоследниеЧисла;
				МалыйКоэффициентКорректировки=БольшиеПоследниеЧисла-НовыеПоследниеЧисла;
			Иначе
				МалыйКоэффициентКорректировки=ПоследниеЧисла-НовыеПоследниеЧисла;
				БольшойКоэффициентКорректировки=БольшиеНовыеПоследниеЧисла-ПоследниеЧисла;
			КонецЕсли;
			МеньшаяЦена=(ЦЦ-МалыйКоэффициентКорректировки)/100;
			БольшаяЦена=(ЦЦ+БольшойКоэффициентКорректировки)/100;
			
			Если МетодОкругления=Перечисления.МетодыОкругления.ВМеньшуюСторону Тогда
				Если МеньшаяЦена<=0 Тогда
					Шаблон = НСтр("ru = 'Невозможно округлить %1 в меньшую сторону до %2!'");
					ТекстСообщения = СтрШаблон(Шаблон, Цена, МеньшаяЦена);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат Цена;
				Иначе
					Возврат МеньшаяЦена;
				КонецЕсли;
				
			ИначеЕсли МетодОкругления=Перечисления.МетодыОкругления.ВБольшуюСтрону Тогда
				Если БольшаяЦена<=0 Тогда
					Шаблон = НСтр("ru = 'Невозможно округлить %1 в большу сторону до %2!'");
					ТекстСообщения = СтрШаблон(Шаблон, Цена, БольшаяЦена);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат Цена;
				Иначе
					Возврат БольшаяЦена;
				КонецЕсли;
			Иначе
				//Все остальные будут по арифметическим
				Если БольшойКоэффициентКорректировки<=МалыйКоэффициентКорректировки Тогда
					Если БольшаяЦена<=0 Тогда
						Шаблон = НСтр("ru = 'Невозможно округлить %1 по арифметическим правилам до %2!'");
						ТекстСообщения = СтрШаблон(Шаблон, Цена, БольшаяЦена);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Возврат Цена;
					Иначе
						Возврат БольшаяЦена;
					КонецЕсли;
				Иначе
					Если МеньшаяЦена<=0 Тогда
						Шаблон = НСтр("ru = 'Невозможно округлить %1 по арифметическим правилам до %2!'");
						ТекстСообщения = СтрШаблон(Шаблон, Цена, МеньшаяЦена);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Возврат Цена;
					Иначе
						Возврат МеньшаяЦена;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе //Если ДлинаНовыхСтрок>СтрДлина(СтрокаЦЦ) Тогда
			//Получается, что в меньшую сторону мы не сможем округлить в принципе, 
			//а по арифметическим правилам всегда будет срабатывать правило в большую сторону
			//ибо сказано так в писании
			//Поэтому НовыеПоследниеЧисла и есть цена...
			БольшаяЦена=НовыеПоследниеЧисла/100;
			Если МетодОкругления=Перечисления.МетодыОкругления.ВМеньшуюСторону Тогда
				Шаблон = НСтр("ru = 'Невозможно округлить %1 в меньшую сторону до %2!'");
				ТекстСообщения = СтрШаблон(Шаблон, Цена, СокрЛП(-БольшаяЦена));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат Цена;
			Иначе
				Возврат БольшаяЦена;
			КонецЕсли;
		КонецЕсли;
	Исключение
		СтрОшибки=ОписаниеОшибки();
		Шаблон = НСтр("ru = 'Не удалось округлить цену по причине: %1'");
		ТекстСообщения = СтрШаблон(Шаблон, СтрОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Цена;
	КонецПопытки;
	
	//Если вдруг сюда дошли, значит ничего округлить не удалось
	Возврат Цена;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
